# Queries from database using SQLite3 in python

In [1]:
import sqlite3

## Opening the existing database and creating new table

In [2]:
dbase = sqlite3.connect('data.db') # Open a database File

In [3]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS employee_records(
    ID TEXT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    DIVISION TEXT NOT NULL,
    STARS INT NOT NULL) ''')
dbase.commit()
#(Name_variable, data_type, (mention if its a Primary key), Null/Not Null)
# NULL implies the column can contain null value

In [4]:
#assign values to the table
dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
        VALUES('65814','James','Maintenance',4)''')
dbase.commit()

In [5]:
#function to add multiple records quickly
def insert_record(ID,NAME,DIVISION,STARS):
    dbase.execute(''' INSERT INTO employee_records(ID,NAME,DIVISION,STARS)
            VALUES(?,?,?,?)''',(ID,NAME,DIVISION,STARS))
  
insert_record('7894','Bob','Hardware',4)
insert_record('2256', 'John','IT', 5)
dbase.commit()

In [6]:
#create a cursor
cursor = dbase.cursor()

#A database cursor is an object that enables traversal over the rows of a result set.
#It allows you to process individual row returned by a query.

In [7]:
#read data in a table
data = cursor.execute(''' SELECT * FROM employee_records ORDER BY NAME''')
for record in data:
        print('ID : '+str(record[0]))
        print('NAME : '+str(record[1]))
        print('DIVISION : '+str(record[2]))
        print('STARS : '+str(record[3])+'\n')

ID : 6
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 7894
NAME : Bob
DIVISION : Hardware
STARS : 4

ID : 2
NAME : Cynthia
DIVISION : hardware
STARS : 3

ID : 3
NAME : Harrison
DIVISION : Mechanics
STARS : 4

ID : 5
NAME : James
DIVISION : Maintenance
STARS : 4

ID : 65814
NAME : James
DIVISION : Maintenance
STARS : 4

ID : 4
NAME : Joan
DIVISION : Electronics
STARS : 3

ID : 2256
NAME : John
DIVISION : IT
STARS : 5

In [8]:
dbase.execute(''' CREATE TABLE IF NOT EXISTS client_records(
    ID TEXT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL,
    CREDIT_LIMIT INT NOT NULL,
    ADDRESS TEXT NOT NULL) ''')
dbase.commit()

In [9]:
def insert_record(ID,NAME,CREDIT_LIMIT,ADDRESS):
    dbase.execute(''' INSERT INTO client_records(ID,NAME,CREDIT_LIMIT,ADDRESS)
            VALUES(?,?,?,?)''',(ID,NAME,CREDIT_LIMIT,ADDRESS))

In [10]:
insert_record('7894','Sam',50000,'Toronto')
insert_record('2256', 'Sarah',6000, 'Montreal')
dbase.commit()

## Queries

In [11]:
cursor.execute("SELECT * FROM client_records;")
cursor.fetchall()

[('7894', 'Sam', 50000, 'Toronto'), ('2256', 'Sarah', 6000, 'Montreal')]

In [12]:
#Execute INNER JOIN on two tables
cursor.execute("""SELECT cr.NAME, cr.ADDRESS, er.DIVISION, cr.ID, er.NAME
FROM client_records as cr
INNER JOIN employee_records as er
ON cr.ID = er.ID""")
cursor.fetchall()

[('Sam', 'Toronto', 'Hardware', '7894', 'Bob'),
 ('Sarah', 'Montreal', 'IT', '2256', 'John')]